tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'github/bootstrap'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'homebrew/dupes'
brew 'ack'
brew 'autoconf'
brew 'cmake'
brew 'xz'
brew 'pcre'
brew 'git'
# brew 'grc'
brew 'heroku'
brew 'hub'
# brew 'icu4c'
# brew 'oniguruma'
# lightweight and flexible command-line JSON processor
brew 'jq'
# Bind to privileged ports on OS X without running your server as root
brew 'launch_socket_server', service_restart: true
# A launchd friendly development DNS server
# brew 'launchdns', service_restart: true
brew 'pkg-config'
brew 'openssl'
brew 'libevent'
brew 'mas'
# brew 'memcached', service_restart: true
# brew 'nginx', service_restart: true
brew 'ruby-build'
brew 'rbenv'
brew 'rbenv-default-gems'
brew 'readline'
brew 'redis', service_restart: true
# static analysis tool for shell scripts
# brew 'shellcheck'
# install your public key in a remote machine's authorized_keys
brew 'ssh-copy-id'
brew 'the_silver_searcher'
brew 'wget'
# brew 'homebrew/versions/elasticsearch17'
# brew 'homebrew/versions/mysql56'
#
brew 'coreutils'
brew 'python'
brew 'rsync'
brew 'svn'
brew 'unzip'
brew 'gzip'
brew 'p7zip'
brew 'unrar'
brew 'ansible'
brew 'htop'
brew 'trash'
# backup dotfiles to dropbox
brew 'mackup'
brew 'sqlite'
# mp3 converter
brew 'lame'
# alias j
brew 'autojump'
# run task continuously in set interval
brew 'watch'
# console youtube downloader
brew 'youtube-dl'
# android adb & fastboot
brew 'android-platform-tools'
# password generator apg -M LNCS -m 12
brew 'apg'
# command-line tool to select default applications
brew 'duti'
# console website downloader
brew 'httrack'
# console dir with subdirs
brew 'tree'
# cURL-like tool for humans
brew 'httpie'
# filtering tool for logs and outputs
brew 'peco'
# server benchmark
brew 'wrk'
# console timer
brew 'utimer'
# terminal-notifier -message "Message" -title "Title" -contentImage '~/image.png'
brew 'terminal-notifier'
# brew 'zplug'
brew 'zsh'
# plugins for quicklook
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlstephen'
cask 'qlmarkdown'
cask 'qlimagesize'
cask 'qlprettypatch'
cask 'qlvideo'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'
# make old apps retina ready
cask 'retinizer'
# cron/launchd manager
cask 'launchcontrol'
# colemak capslock for delete
cask 'seil'
# show pressed keys for screencast
cask 'keycastr'
# video converter # constant quality 23
cask 'handbrake'
cask 'vlc'
# markdown writer
cask 'macdown'
cask 'iterm2-beta'
cask 'gopro-studio'
cask 'postgres'
cask 'postico'
cask 'raw-photo-processor'
# pdf notes export
cask 'skim'
cask 'sequel-pro'
cask 'sublime-text'
cask 'telegram-desktop-dev'
# vpn manager
cask 'tunnelblick'
cask 'xnviewmp'
#
cask 'appcleaner'
cask 'flux'
cask 'github-desktop'
cask 'google-chrome'
cask 'keepingyouawake'
cask 'quitter'
# cask 'screenhero'
# cask 'sizeup'
# cask 'steam'
# mux and tag mp4 files
cask 'subler'
cask 'textexpander'
# cask 'textmate'
cask 'transmission'
cask 'webtorrent'
cask 'clipmenu'
cask 'dropbox'
cask 'google-drive'
# cask 'viscosity'
# cask 'vmware-fusion'
# cask 'zoomus'
# mas 'Remote Desktop (3.8)', id: 409907375
mas 'Mactracker', id: 430255202
# mas 'Booster (1.2.0)', id: 907023335
# mas '1Password (6.3.3)', id: 443987910
# mas 'iMovie (10.1.2)', id: 408981434
# mas 'OneDrive (17.3.6517)', id: 823766827
# mas 'Sketch (2.4.4)', id: 402476602
mas 'Slack', id: 803453959
# mas 'Pixelmator (3.5.1)', id: 407963104
# mas 'Reeder (3.0.1)', id: 880001334
# mas 'Textual (6.0.1)', id: 896450579

mas 'Yandex.Disk (1.4.10)', id: 560459030
mas 'ArcSoft Photo+ (3.0.90138)', id: 628703558
mas 'VOX (2.8.5)', id: 461369673
mas 'Monosnap (3.3.0)', id: 540348655
mas 'Cloud Mail.Ru (16.08.0015)', id: 893068358
mas 'The Unarchiver (3.11.1)', id: 425424353
mas 'MagicanRest (1.0.1)', id: 634255909
mas 'Telephone (1.2.1)', id: 406825478
mas 'Pixlr (1.1.1)', id: 880663569
mas 'Debit & Credit (2.0.1)', id: 882637653
mas 'Tumblr (1.0.1)', id: 929285034
# biggest apps
cask 'java'
cask 'virtualbox'
cask 'vagrant'
mas 'Numbers (4.0)', id: 409203825
mas 'Pages (6.0)', id: 409201541
mas 'Keynote (7.0)', id: 409183694
mas 'Xcode (8.0)', id: 497799835
